-- CREATE USER 'ecommerceApp'@'ecommerce-backend' IDENTIFIED BY 'ecommerceApp';

-- GRANT ALL PRIVILEGES ON * . * TO 'ecommerceApp'@'ecommerce-backend';


-- ALTER USER 'ecommerceApp'@'ecommerce-backend'
-- IDENTIFIED WITH mysql_native_password 
-- BY 'ecommerceApp';

-- -----------------------------------------------------
-- Schema full-stack-ecommerce
-- -----------------------------------------------------
DROP SCHEMA IF EXISTS `full-stack-ecommerce`;

CREATE SCHEMA `full-stack-ecommerce`;
USE `full-stack-ecommerce` ;

-- -----------------------------------------------------
-- Table `full-stack-ecommerce`.`product_category`
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS `full-stack-ecommerce`.`product_category` (
  `id` BIGINT(20) NOT NULL AUTO_INCREMENT,
  `category_name` VARCHAR(255) NULL DEFAULT NULL,
  PRIMARY KEY (`id`))
ENGINE=InnoDB
AUTO_INCREMENT = 1;

-- -----------------------------------------------------
-- Table `full-stack-ecommerce`.`product`
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS `full-stack-ecommerce`.`product` (
  `id` BIGINT(20) NOT NULL AUTO_INCREMENT,
  `sku` VARCHAR(255) DEFAULT NULL,
  `name` VARCHAR(255) DEFAULT NULL,
  `description` VARCHAR(255) DEFAULT NULL,
  `ingredients` TEXT DEFAULT NULL,
  `recipe` TEXT DEFAULT NULL,
  `unit_price` DECIMAL(13,2) DEFAULT NULL,
  `image_url` VARCHAR(255) DEFAULT NULL,
  `active` BIT DEFAULT 1,
  `units_in_stock` INT(11) DEFAULT NULL,
   `date_created` DATETIME(6) DEFAULT NULL,
  `last_updated` DATETIME(6) DEFAULT NULL,
  `category_id` BIGINT(20) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_category` (`category_id`),
  CONSTRAINT `fk_category` FOREIGN KEY (`category_id`) REFERENCES `product_category` (`id`)
) 
ENGINE=InnoDB
AUTO_INCREMENT = 1;


-- -----------------------------------------------------
-- Add sample data
-- -----------------------------------------------------

INSERT INTO product_category(CATEGORY_NAME) VALUES ('International Cusine');

INSERT INTO `product` (`id`, `sku`, `name`, `description`, `ingredients`, `recipe`, `unit_price`, `image_url`, `active`, `units_in_stock`, `date_created`, `last_updated`, `category_id`) VALUES
(1, 'bg-100',
 'Салата Цезар с хрупкаво пиле',
 'салата',
 '- 900 ml олио
  * 150 ml за дресинга  

  * 300 ml за пържене

- 2 бр. яйца (1 бр. за майонезата и 1 бр. за панировката)

- 2 с.л. горчица

- 2 лимони

- сокът и кората

- 100 g пармезан

- 400 g пилешки филета

- 60 g брашно

- 100 g галета

- 600 g салата Айсберг накъсана и почистена

- 2 бр. багети

- франзела или стар хляб за крутони или препечени филийки

- сол и черен пипер',
 '###### Време за приготвяне: **30 min** 

1. Приготвяме домашна майонеза, като наливаме 300 ml олио, добавяме 1 яйце и пасираме. С много бавно и плавно движение изтегляме пасатора нагоре, за да получим по-гъста текстура.  
 
2. Добавяме горчицата, настъргания пармезан, кората и сока от лимона.  
 
3. Овкусяваме със сол и пипер. Можем да съхраняваме в хладилник до момента на поднасяне на салтата (не повече от 24 часа).  
 
4. Пилешкото овкусяваме със сол и пипер и овалваме в панировка от брашно, яйце и галета. Пържим в олио на тиган, докато хване златиста коричка.  
 
5. Нарязваме или накъсваме Айсберга и го овкусяваме с дресинга.  
 
6. Добавяме пилешкото и пармезана.  
 
7. По желание можем да добавим крутони или препечени филийки.',
 '14.99',
 'https://ensaladacesar.info/img/ensalada-cesar-con-pollo-173.jpg',
 1,
 100, '2020-02-10 22:00:00.000000',
 '2020-11-02 19:02:28.124000',
 1),

(2, 'bg-101',
 'Гювече със сирене, домати, чушки и препечен хляб с масло',
 'предястие',
 '- 4 домата  
 
- 4 яйца  
 
- 400 g сирене  
 
- 4 зелени чушки  
 
- 8 резена хляб замразен  
 
- маслиново масло  
 
- масло за намазване на хляба  
 
- чубрица  
 
- сол и черен пипер',
 'Време за приготвяне: **20 min**  
 
1. Изпичаме чушките на котлон, тиган или чушкопек и ги обелваме. 
2. По желание обелваме и доматите, след което ги нарязваме. 
3. Поставяме ги заедно с чушките в гювечето, овкусяваме с маслиново масло, а отгоре подреждаме сиренето, чукваме яйцата и ги посоляваме. 
4. Печем на 180° около 30 min от студена фурна. 
5. Замразения хляб изпичаме в тиган (за вкус като от едно време) или на фурна, намазваме с масло и поръсваме с чубрица, докато е горещ. Може да използваме и пресен',
 '20.99',
 'https://gotvi.lidl.bg/var/site/storage/images/_aliases/960x720/8/4/8/6/686848-1-bul-BG/Gyuveche-s-s-sirene-domati-chushki-i-prepechen-hlyab-s-maslo.jpg',
 1,
 100, '2020-02-10 22:00:00.000000',
 '2020-11-02 19:05:29.622000',
 1),

(3, 'bg-102',
 'Бургер от сьомга, поднесен със сос Тартар и рукола',
 'основно ястие',
 '- 4 бр. замразен бургер от сьомга  
 
- 4 бр. пълнозърнести хлебчета  
 
- 120 g рукола  
 
За соса  
---
 
- 80 g кисело мляко  
 
- 40 g майонеза  
 
- 10 g див лук  
 
- 20 g кисели краставички  
 
- 10 g каперси  
 
- 10 ml лимонов сок  
 
- 10 ml олио  
 
- сол  
 
- черен пипер',
 'Време за приготвяне: **15 min**  
 
1. Разрязваме питките на две и ги запечатваме от двете страни на тиган.  
 
2. В предварително загрята мазнина на средно силен котлон пържим директно замразения бургер в продължение на 8 – 10 min. Запечатваме го от всяка страна.  
 
3. В басан смесваме всички продукти за соса и ги объркваме до получаването на хомогенна смес.  
 
4. Поднасяме, като слагаме сьомга бургера върху хлебчето, след това соса, руколата и втората половина на хлебчето най-отгоре.',
 '14.99',
 'https://gotvi.lidl.bg/var/site/storage/images/_aliases/960x960/0/4/0/7/687040-1-bul-BG/Burger-ot-s-omga-podnesen-s-s-sos-Tartar-i-rukola.jpg',
 1,
 100, '2020-02-10 22:00:00.000000',
 '2020-11-02 19:07:20.058000',
 1),

(4, 'bg-103',
 'Кавърма с гъби и зеленчуци',
 'основно ястие',
 '- 1 kg кавърма oт свинско месо  
 
- 500 g червени чушки  
 
- 500 g зелени чушки  
 
- 500 g печурки  
 
- пресен магданоз 1/2  
 
- 3 - 4 скилидки чесън  
 
- 1 глава лук  
 
- 20 ml олио  
 
- 2 бр. домата  
 
- 1 ч.л. чубрица  
 
- сол и черен пипер',
 'Време за приготвяне: **120 min**  
 
1. Слагаме месото в гювеч и го печем час и половина на 180°С.
2. Отделно почистваме зеленчуците и ги нарязваме на големи кубчета. 
3. В тенджера загряваме олиото и задушаваме последователно лука, после и гъбите. 
4. Накрая прибавяме към тях и доматите, които предварително сме обелили и нарязали на едро.
5. Овкусяваме зеленчуците със сол, черен пипер, чубрица, чесън и ситно нарязания магданоз и ги прибавяме към изпеченото месо. 
6. Запичаме кавърмата за още 30 – 35 min. 
7. Сервираме с поръска от пресен магданоз.',
 '13.99',
 'https://gotvi.lidl.bg/var/site/storage/images/_aliases/960x960/6/3/1/7/687136-1-bul-BG/Kav-rma-s-g-bi-i-zelenchuci.jpg',
 1,
 100, '2020-02-10 22:00:00.000000',
 '2020-11-02 19:09:16.336000',
 1),

(5, 'bg-104',
 'Рибай стек с винен сос и ризото с гъби',
 'основно ястие',
 '- 4 бр. рибай стек  
 
- 400 g масло  
 
- 4 стрък мащерка  
 
- 800 ml зеленчуков бульон  
 
- 600 ml говежди бульон  
 
- 600 ml червено вино  
 
- 4 глава лук  
 
- 400 g ориз за ризото  
 
- 400 g печурки  
 
- 200 g пармезан  
 
- маслиново масло  
 
- сол и черен пипер',
 'Време за приготвяне: **60 min**  
 
1. Oвкусяваме стека със сол и пипер и го запечатваме на много нагорещен тиган за по 2-3 min от всяка страна за степен на изпичане мидиъм. 
+ Завършваме с ½ от маслото и прясната мащерка. Оставяме го да почине.  
 
2. В същия тиган задушаваме лука, нарязан на ситно, добавяме червеното вино и оставяме да се редуцира. Доливаме бульона и оставяме да се редуцира отново. Овкусяваме със сол и пипер.  
 
3. Запържваме гъбите в маслиново масло. 
4. Добавяме ориза и също го пържим, докато стане леко кристален. 
5. След това наливаме зеленчуковия бульон, докато оризът омекне, като бъркаме постоянно. 
6. На финала завършваме с масло, пармезан, сол и пипер.',
 '18.99',
 'https://gotvi.lidl.bg/var/site/storage/images/_aliases/960x720/8/6/1/7/687168-1-bul-BG/Ribaj-stek-s-vinen-sos-i-rizoto-s-g-bi.jpg',
 1,
 100, '2020-02-10 22:00:00.000000',
 '2020-11-02 19:11:59.986000',
 1);

